app/views/dashboard/dashboard.html.erb

SELECT COUNT(*) AS count_all, (DATE_TRUNC('day', (started_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC' AS date_trunc_day_started_at_timestamptz_interval_0_second_at_time FROM "visits" WHERE (started_at IS NOT NULL) GROUP BY (DATE_TRUNC('day', (started_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC'
---
	<h5> Visitors per Day</h5>
	<%= line_chart Visit.group_by_day(:started_at).count %>

SELECT COUNT(*) AS count_all, "ahoy_events"."name" AS ahoy_events_name FROM "ahoy_events" GROUP BY "ahoy_events"."name"
---
	<h5> Visitors Category</h5>
		<%= column_chart Ahoy::Event.group(:name).count %>