app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "content", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asd"], ["content", "<p>asd</p>\r\n"], ["created_at", "2018-01-10 08:51:05.159553"], ["updated_at", "2018-01-10 08:51:05.159553"], ["category_id", 3]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "category_id" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["category_id", 2], ["updated_at", "2018-01-27 05:31:13.599279"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)